{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Tim. I am a data scienstist and a sports analytics aficionado. I recently graduated from Northeastern University with my Bachelor's in CS and Business. At Northeastern, I was vice president of the Sports Business Innovation Network and did analytics for the baseball team. I am currently looking for roles in Data Science, Machine Learning, and Data Engineering. ",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "titles": ["MLB Build a Team", "Medium Article"],
        "startDate": "2022",
        "descriptions": ["I developed a web app, hosted on Render, that empowers passionate baseball fans to project the number of wins their dream team could secure in a full 162-game MLB season. This platform serves as an invaluable tool for multiple use-cases, enhancing the fan experience in a number of ways. For instance, it can be utilized for roster construction, allowing fans to experiment with various lineups and pitching rotations to find the optimal configuration. This helps shed light on potential trades or acquisitions that could be beneficial for a team. Additionally, it serves as a robust player evaluation tool, enabling users to quantify the impact of individual athletes on a team's overall performance. By allowing fans to manipulate rosters and view the resulting projections, the web app adds a new, data-driven dimension to the way fans engage with the sport.",
                        "I've authored a Medium article that provides an in-depth look at my modeling process. Stay tuned as I unveil exciting updates to the algorithm's architecture, including the integration of advanced calibration techniques that go beyond conventional linear models."],
        "images": [
          "images/portfolio/mlbbat/mlb.png",
          "images/portfolio/mlbbat/medium.png"
        ],
        "urls": ["https://github.com/timseymour42/MLB-Build-a-Team", "https://medium.com/@timseymour1042/mlb-build-a-team-7bd338abe2a2"],
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-mysql-plain",
            "name": "MySQL"
          }
        ]
      },
      {
        "titles": ["ShotQuality Kaggle Competition", "Exploratory Data Analysis", "Baseline Model", "Assigning Boxout Responsibilities", "Spacing", "Model Comparison", "Ensemble", "CNNs", "OFFREB+", "Basketball Strategy Takeaways"],
        "startDate": "2023",
        "descriptions": ["I won first place in a data science competition focused on predicting offensive rebounding probability using player location data.",
                        "I leveraged data visualizations to conduct a thorough exploratory analysis, covering both univariate and bivariate assessments. This allowed me to examine key patterns like the frequency of various shot locations (shown above), the frequency of different rebound types, and the intricate relationship between offensive rebound rates and variables like shot and player distances from the hoop. Through this analytical journey, I uncovered valuable insights that were instrumental for feature engineering. For instance, I identified shot distance zones with similar offensive rebound probabilities, as well as the critical role played by having multiple players near the basket.",
                        "After the initial data exploration, I built a baseline model using XGBoost. The model only used basic features like the distance of players and the shot from the hoop. Despite its simplicity, it achieved a cross-validated log loss of 0.5809. The feature importances from this model further emphasized that offensive rebounding is a team effort, requiring multiple well-positioned offensive players. This baseline model served as a valuable benchmark for assessing the impact of more sophisticated feature engineering down the line.",
                        "Understanding who's likely to box out whom is key to predicting the chances of an offensive rebound. Simply measuring distance to the hoop doesn't capture the full picture, especially when an offensive player is in front of a defender. To tackle this, I use the Hungarian Assignment Algorithm to determine the optimal boxout assignments for defensive players. This algorithm considers both the distance from each defender to each attacker, as well as the offensive player's influence on the court, measured by their betweenness centrality in a network that includes all offensive players and the hoop. Once these boxout assignments are made, I calculate important metrics like the boxout angle (the angle formed from the hoop to the defender and then to the offensive player) and boxout position (a metric that combines the offensive player's distance to the hoop and the boxout angle). These features turn out to be strong predictors in my analysis.",
                        "Inspired by the insights from ShotQuality's Twitter, I set out to measure both offensive and defensive spacing on the basketball court. Good floor spacing can create opportunities for offensive rebounds. To assess this spacing, players on a team are arranged in a clockwise direction based on their angle to the baseline. Starting from the hoop, a line is drawn to the first player, then from that player to the second, and so on, ultimately forming a hexagon. The area of this hexagon serves as an estimate of the court's spacing.",
                        "In this section, I compare the performance of different machine learning models in predicting offensive rebounds, measured by Log Loss. XGBoost comes out on top with a score of 0.5781, showing a meaningful improvement of 0.0028 over our baseline model. While Random Forest Classifier and Logistic Regression performed well, with scores of 0.5785 and 0.5792 respectively, they couldn't quite match XGBoost's efficacy. Given XGBoost's known capabilities for handling complex data structures and relationships, its leading performance aligns well with our expectations.",
                        "I dive into the world of ensemble modeling with a StackingClassifier, which layers multiple base models and a meta-model to make its predictions. Our base models include XGBoost, Logistic Regression, and a Random Forest Classifier, each carefully tuned for optimal performance. We utilized Stratified K-Fold Cross-Validation for a balanced evaluation. Intriguingly, the ensemble's average Log Loss of 0.5781 matches the score of our top-performing individual model, XGBoost. While this shows that the ensemble model holds its own, it also indicates room for further experimentation to truly harness the collective strengths of our diverse individual models.",
                        "I explore the innovative use of Convolutional Neural Networks (CNNs) for a nuanced, spatial analysis of basketball plays. CNNs excel in processing visual data, making them an ideal tool for capturing the spatial configurations of players on the court. The approach involves transforming traditional play-by-play data into a high-resolution grid, layered with specific game aspects like offense, defense, and shooting positions. Trained over 10 epochs, our CNN model yielded a promising Validation Loss of 0.5866. While these results are encouraging, they also signal room for optimization. Future work could involve architectural enhancements, hyperparameter fine-tuning, and data augmentation techniques like image rotation. All aimed at a deeper, more accurate understanding of in-game dynamics.",
                        "Introducing OFFREB+, a novel basketball statistic aimed at providing a nuanced measure of an offensive player's rebounding effectiveness. Developed from the feature 'Boxout Position,' which has been instrumental in boosting our model's performance, OFFREB+ combines a player's offensive rebounding rate with a normalizing factor related to their average boxout position faced. By doing so, OFFREB+ offers a more context-rich assessment of a player's ability to secure offensive rebounds relative to their positional challenges. The formula encapsulates variables like the angle from the hoop to the defender and the offensive player, as well as the offensive player's distance to the hoop. OFFREB+ could be a game-changer in evaluating individual performance against expectations in the realm of offensive rebounding.",
                        "In this section, I discuss critical basketball strategies informed by our model's feature importances. 'boxout_position_mean' and 'log_boxout_angle_mean' stand out for their influence, underscoring the essential strategy of staying between your man and the basket for effective rebounding. On another note, the feature 'off_within_10ft_weakside_sum' points to the importance of having players on the weak side of the court, validating the tactic to prioritize weakside presence for advantageous rebounding positions. Lastly, 'second_closest_off_to_hoop' highlights the significance of multiple offensive players being near the hoop, supporting the strategy to delegate multiple players to crash the offensive boards, though this comes with the risk of being more exposed to transition counter-attacks. Together, these key takeaways offer coaches and players targeted strategies to enhance both rebounding and overall gameplay."
                      ],
        "images": [
          "images/portfolio/shotquality/sqlogo.png",
          "images/portfolio/shotquality/heatmap.png",
          "images/portfolio/shotquality/distances.png",
          "images/portfolio/shotquality/boxout.png",
          "images/portfolio/shotquality/spacing.png",
          "images/portfolio/shotquality/model_performance.png",
          "images/portfolio/shotquality/ensemble.png",
          "images/portfolio/shotquality/channels.png",
          "images/portfolio/shotquality/formula.png",
          "images/portfolio/shotquality/feat.png"
        ],
        "urls": ["https://github.com/timseymour42/shotquality-offensive-rebounding", "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Exploratory-Data-Analysis-&-Data-Preprocessing", "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Baseline-Model",
                "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Complex-Feature-Engineering", "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Complex-Feature-Engineering", "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Model-Experimentation",
                "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Stacking-Classifier-for-Model-Ensembling", "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Convolutional-Neural-Network-(CNN)-for-Spatial-Analysis", "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Conclusion",
                "https://www.kaggle.com/code/timseymour/sq-rebounding-submission#Conclusion"],
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-tensorflow-original",
            "name": "TensorFlow"
          }
        ]
      },
      {
        "titles": ["Kelly Criterion Feature", "Kelly Criterion Feature"],
        "startDate": "2023",
        "descriptions": ["Made a significant contribution to the open-source project, NBA-Machine-Learning-Sports-Betting, aimed at predicting NBA game outcomes and point totals. I integrated a Kelly Criterion feature through a feature flag, empowering users to calculate the optimal wager amount by comparing the model's predictions with the sportsbook's odds.",
                        "In the Kelly Criterion section, users gain a valuable benchmark for determining mathematically sound and responsible wager amounts. As illustrated in the example, the model identifies a betting edge, and my feature subsequently recommends an appropriate wager amount based on the expected value of the bet."],
        "images": [
          "images/portfolio/nbamlsb/nba.png",
          "images/portfolio/nbamlsb/KC.png"
        ],
        "urls": ["https://github.com/kyleskom/NBA-Machine-Learning-Sports-Betting"],
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Veolia North America",
        "title": "Data Scientist",
        "years": "7.2022 - present",
        "mainTech": [
          "Python"
        ],
        "technologies": [
          "Python",
          "Tableau",
          "SQL Server",
          "Jira",
          "Scikit-Learn",
          "Pandas",
          "NumPy"
        ]
      },
      {
        "company": "Wayfair",
        "title": "Data Analyst",
        "years": "06.2021 - 12.2021",
        "mainTech": [
          "Google BigQuery"
        ],
        "technologies": [
          "Google BigQuery",
          "SQL Server",
          "Python",
          "Jupyter Notebook",
          "Looker"
        ]
      }
    ]
  }