{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Tim. I am a data scienstist and a sports analytics nerd. I recently graduated from Northeastern University with my Bachelor's in CS and Business. At Northeastern, I was vice president of the Sports Business Innovation Network and did analytics for the baseball team. I am currently looking for roles in Data Science, Machine Learning, and Data Engineering. ",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "titles": "Animal Shelter",
        "startDate": "2020",
        "descriptions": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "titles": ["ShotQuality Kaggle Competition", "ShotQuality Kaggle Competition", "Exploratory Data Analysis", "Baseline Model", "Assigning Boxout Responsibilities", "Spacing"],
        "startDate": "2023",
        "descriptions": ["I won first place in a data science competition focused on predicting offensive rebounding probability using player location data.",
                        "I leveraged data visualizations to conduct a thorough exploratory analysis, covering both univariate and bivariate assessments. This allowed me to examine key patterns like the frequency of various shot locations (shown above), the frequency of different rebound types, and the intricate relationship between offensive rebound rates and variables like shot and player distances from the hoop. Through this analytical journey, I uncovered valuable insights that were instrumental for feature engineering. For instance, I identified specific zones on the court where shot distances with similar offensive rebound probabilities, as well as the critical role played by having multiple players near the basket.",
                        "Following EDA, I developed a baseline XGBoost model using only player and shot distances from the hoop. This feature set achieved a cross validated log loss of 0.5809. The feature importances derived from the model reinforced the idea that offensive rebounding is a collective task requiring more than one well positioned offensive player. This model served as a point of comparison to evaluate the benefits of more complex feature engineering.",
                        "Understanding which players are most likely to box out one another is crucial to understanding the chances of an offensive rebound. If an offensive player is in front of a defensive player, this cannot be captured by a distance to the hoop metric. To optimally choose which offensive player a defensive rebounder should box out, I employ the Hungarian Assignment Algorithm. This technique will use the distance from each defensive player to each offensive player and the betweenness centrality of the offensive player in a fully connected graph of the offense and the hoop. Once boxout responsibility estimates have been assigned, I calculate highly predicting features such as the boxout angle (angle from hoop to defender to offensive player) and boxout position (combination of offensive distance to the hoop and boxout angle) among many others."],
        "images": [
          "images/portfolio/shotquality/sqlogo.png",
          "images/portfolio/shotquality/heatmap.png",
          "images/portfolio/shotquality/distances.png",
          "images/portfolio/shotquality/boxout.png",
          "images/portfolio/shotquality/spacing.png",
          "images/portfolio/shotquality/model_performance.png",
          "images/portfolio/shotquality/ensemble.png",
          "images/portfolio/shotquality/channels.png",
          "images/portfolio/shotquality/formula.png",
          "images/portfolio/shotquality/feat.png"
        ],
        "url": "https://github.com/timseymour42/shotquality-offensive-rebounding",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-tensorflow-original",
            "name": "TensorFlow"
          }
        ]
      },
      {
        "titles": "3D Object Viewer",
        "startDate": "2015",
        "descriptions": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Veolia North America",
        "title": "Data Scientist",
        "years": "7.2022 - present",
        "mainTech": [
          "Python"
        ],
        "technologies": [
          "Python",
          "Tableau",
          "SQL Server",
          "Jira",
          "Scikit-Learn",
          "Pandas",
          "NumPy"
        ]
      },
      {
        "company": "Wayfair",
        "title": "Data Analyst",
        "years": "06.2021 - 12.2021",
        "mainTech": [
          "Google BigQuery"
        ],
        "technologies": [
          "Google BigQuery",
          "SQL Server",
          "Python",
          "Jupyter Notebook",
          "Looker"
        ]
      }
    ]
  }